#Дано целое положительное число. Вывести символы, изображающие цифры этого числа.

number = int(input("Введите целое положительное число: "))
print(' '.join(str(number)))